[
    {
        "id": 1,
        "title": "TECH & SOCIETY: GOOD, BAD & OTHER",
        "subject": "First-Year Seminar",
        "credit": "3",
        "description": "Computing and information technology has improved our lives in many ways, contributing to significant advances in science and medicine; making it easy and efficient to communicate with people across the world; and more. However, the same technologies can also have negative impacts, such as the move to a surveillance society and surveillance capitalism; and social media contributing to depression in young people and the weaponization of disinformation. This seminar will explore technical, cultural, legal, and economic factors that can impact how computing technology is used, while raising the question of how to encourage and ensure that these technologies are used for good.",
        "year": "First",
        "semester": "Fall",
        "img": "",
        "link": ""
    },
    {
        "id": 2,
        "title": "PILATES MAT",
        "subject": "Physical Education",
        "credit": "1",
        "description": "A Pilates-based mat exercises class to strengthen core (abs, back and hips) and sculpting techniques for entire body using various equipment. Emphasis on proper breathing and alignment.",
        "year": "First",
        "semester": "Fall",
        "img": "",
        "link": ""
    },
    {
        "id": 3,
        "title": "INTRO TO COMPUTER SCIENCE/PROGRAMMING IN JAVA",
        "subject": "Computer Science",
        "credit": "3",
        "description": "A general introduction to computer science for science and engineering students interested in majoring in computer science or engineering. Covers fundamental concepts of computer science, algorithmic problem-solving capabilities, and introductory Java programming skills. Assumes no prior programming background. Columbia University students may receive credit for only one of the following two courses: 1004 or 1005.",
        "year": "First",
        "semester": "Fall",
        "img": "",
        "link": ""
    },
    {
        "id": 4,
        "title": "DATA STRUCTURES IN JAVA",
        "subject": "Computer Science",
        "credit": "3",
        "description": "Data types and structures: arrays, stacks, singly and doubly linked lists, queues, trees, sets, and graphs. Programming techniques for processing such structures: sorting and searching, hashing, garbage collection. Storage management. Rudiments of the analysis of algorithms. Taught in Java. Note: Due to significant overlap, students may receive credit for only one of the following three courses: COMS W3134, COMS W3136, COMS W3137.",
        "year": "First",
        "semester": "Fall",
        "img": "",
        "link": ""
    },
    {
        "id": 5,
        "title": "CALCULUS III",
        "subject": "Mathematics",
        "credit": "3",
        "description": "Prerequisites: MATH UN1101 or the equivalent Vectors in dimensions 2 and 3, complex numbers and the complex exponential function with applications to differential equations, Cramers rule, vector-valued functions of one variable, scalar-valued functions of several variables, partial derivatives, gradients, surfaces, optimization, the method of Lagrange multipliers. (SC)",
        "year": "First",
        "semester": "Fall",
        "img": "",
        "link": ""
    },
    {
        "id": 6,
        "title": "INTRODUCTION TO COGNITIVE SCIENCE",
        "subject": "Cognitive Science",
        "credit": "3",
        "description": "The goal of cognitive science is to understand how the mind works. Trying to understand our own minds is perhaps the most ambitious and exciting (and difficult) project in all of science, and this project requires tools drawn from fields including experimental psychology, computer science and artificial intelligence, linguistics, vision science, philosophy, anthropology, behavioral economics, and several varieties of neuroscience (among others). We will employ these perspectives while exploring the nature of mental processes such as perception, reasoning, memory, attention, imagery, language, intelligence, decision-making, morality— and even attraction and love.",
        "year": "First",
        "semester": "Fall",
        "img": "",
        "link": ""
    },
    {
        "id": 5,
        "title": "FEMINIST FAIRYTALES",
        "subject": "First-Year Writing",
        "credit": "3",
        "description": "In this class we will read and discuss feminist fairy tales: adaptations of classic tales and newly-imagined stories which privilege female agency and offer up critiques of patriarchal structures. In dialog with texts that center women and other intersecting identities, we will talk about colorism, colonialism, sexuality, desire, misogyny, motherhood, and more. Readings, subject to change, include texts by Nalo Hopkinson, Carmen Maria Machado, Luisa Valenzuela, Suniti Namjoshi, Helen Oyeyemi, and Kelly Link.",
        "year": "First",
        "semester": "Spring",
        "img": "",
        "link": ""
    },
    {
        "id": 6,
        "title": "LINEAR ALGEBRA",
        "subject": "Computer Science",
        "credit": "3",
        "description": "Matrices, vector spaces, linear transformations, eigenvalues and eigenvectors, canonical forms, applications. (SC)",
        "year": "First",
        "semester": "Spring",
        "img": "",
        "link": ""
    },
    {
        "id": 7,
        "title": "DISCRETE MATHEMATICS",
        "subject": "Computer Science",
        "credit": "4",
        "description": "Logic and formal proofs, sequences and summation, mathematical induction, binomial coefficients, elements of finite probability, recurrence relations, equivalence relations and partial orderings, and topics in graph theory (including isomorphism, traversability, planarity, and colorings).",
        "year": "First",
        "semester": "Spring",
        "img": "",
        "link": ""
    },
    {
        "id": 8,
        "title": "ADVANCED PROGRAMMING",
        "subject": "Computer Science",
        "credit": "4",
        "description": "C programming language and Unix systems programming. Also covers Git, Make, TCP/IP networking basics, C++ fundamentals.",
        "year": "First",
        "semester": "Spring",
        "img": "",
        "link": ""
    },
    {
        "id": 9,
        "title": "CALCULUS IV",
        "subject": "Mathematics",
        "credit": "3",
        "description": "Prerequisites: MATH UN1102 and MATH UN1201 or the equivalent Multiple integrals, Taylor's formula in several variables, line and surface integrals, calculus of vector fields, Fourier series. (SC)",
        "year": "Second",
        "semester": "Fall",
        "img": "",
        "link": ""
    },
    {
        "id": 10,
        "title": "FIRST YEAR CHINESE I",
        "subject": "Chinese",
        "credit": "5",
        "description": "This course is designed for beginners of the Chinese language. The goal of the course is to develop basic communication skills in listening, speaking, reading, and writing modern colloquial Chinese. Students who can already speak Mandarin will not be accepted into this course. ",
        "year": "Second",
        "semester": "Fall",
        "img": "",
        "link": ""
    },
    {
        "id": 11,
        "title": "INTRODUCTION TO ART HISTORY I",
        "subject": "Art History",
        "credit": "4",
        "description": "The first half of the Introduction to Art History explores premodern art and architecture around the world, from cave paintings to Song dynasty landscapes and Renaissance sculpture. Lectures and discussion sections are organized around themes, including nature and naturalism, death and the afterlife, ornament and abstraction, gender and sexuality, colonialism and conversion, and ritual and divinity. Visits to museums across New York are also an integral component to the course.",
        "year": "Second",
        "semester": "Fall",
        "img": "",
        "link": ""
    },
    {
        "id": 12,
        "title": "ASTRONOMY LAB I",
        "subject": "Astronomy",
        "credit": "1",
        "description": "Laboratory for ASTR UN1403. Projects include observations with the departments telescopes, computer simulation, laboratory experiments in spectroscopy, and the analysis of astronomical data. Lab 1 ASTR UN1903 - goes with ASTR BC1753, ASTR UN1403 or ASTR UN1453.",
        "year": "Second",
        "semester": "Fall",
        "img": "",
        "link": ""
    },
    {
        "id": 13,
        "title": "ANOTHER EARTH",
        "subject": "Astronomy",
        "credit": "3",
        "description": "This course will explore the unique properties of Earth, compared to other planets in the Solar System, and the possibility of Earth-like planets around other stars. The basics of the Solar System, gravity, and light will be covered, as well as the geology and atmospheres of the terrestrial planets. The properties of Earth that allowed life to develop and whether life can develop on other planets will be discussed. Finally, the discovery of planets beyond our Solar System and the likelihood of another Earth will be a key component of the course.",
        "year": "Second",
        "semester": "Fall",
        "img": "",
        "link": ""
    },
    {
        "id": 14,
        "title": "FIRST YEAR CHINESE II",
        "subject": "Chinese",
        "credit": "5",
        "description": "This course offers an immersive look into contemporary China, combining both dialogues and narratives. Through meticulously designed texts and exercises, it highlights key Chinese linguistic structures and functions, provides cultural insights, and draws students into China’s continually evolving landscape. By the end of the full course (two semesters), students are expected to have the following proficiencies: Listening, Speaking, Reading, Writing, Culture.",
        "year": "Second",
        "semester": "Spring",
        "img": "",
        "link": ""
    },
    {
        "id": 15,
        "title": "FUNDAMENTALS OF COMPUTER SYSTEMS",
        "subject": "Computer Science",
        "credit": "3",
        "description": "Fundamentals of computer organization and digital logic. Boolean algebra, Karnaugh maps, basic gates and components, flipflops and latches, counters and state machines, basics of combinational and sequential digital design. Assembly language, instruction sets, ALU’s, single-cycle and multi-cycle processor design, introduction to pipelined processors, caches, and virtual memory.",
        "year": "Second",
        "semester": "Spring",
        "img": "",
        "link": ""
    },
    {
        "id": 16,
        "title": "INTRODUCTION TO DATABASES",
        "subject": "Computer Science",
        "credit": "3",
        "description": "The fundamentals of database design and application development using databases: entity-relationship modeling, logical design of relational databases, relational data definition and manipulation languages, SQL, XML, query processing, physical database tuning, transaction processing, security. Programming projects are required.",
        "year": "Second",
        "semester": "Spring",
        "img": "",
        "link": ""
    },
    {
        "id": 17,
        "title": "USER INTERFACE DESIGN",
        "subject": "Computer Science",
        "credit": "3",
        "description": "Introduction to the theory and practice of computer user interface design, emphasizing the software design of graphical user interfaces. Topics include basic interaction devices and techniques, human factors, interaction styles, dialogue design, and software infrastructure. Design and programming projects are required.",
        "year": "Second",
        "semester": "Spring",
        "img": "",
        "link": ""
    },
    {
        "id": 18,
        "title": "CALC-BASED INTRO TO STATISTICS",
        "subject": "Statistics",
        "credit": "3",
        "description": "Prerequisites: one semester of calculus. Designed for students who desire a strong grounding in statistical concepts with a greater degree of mathematical rigor than in STAT W1111. Random variables, probability distributions, pdf, cdf, mean, variance, correlation, conditional distribution, conditional mean and conditional variance, law of iterated expectations, normal, chi-square, F and t distributions, law of large numbers, central limit theorem, parameter estimation, unbiasedness, consistency, efficiency, hypothesis testing, p-value, confidence intervals, maximum likelihood estimation.",
        "year": "Second",
        "semester": "Fall",
        "img": "",
        "link": ""
    }
]